P8/k6/reportes/reporte-load-test.txt

     ✓ status es 200
     ✓ responde status ok

     checks.........................: 100.00% 1112 out of 1112
     data_received..................: 152 kB  2.5 kB/s
     data_sent......................: 48 kB   794 B/s
     http_req_blocked...............: avg=43.11µs  min=8.29µs  med=15.04µs  max=3.48ms   p(90)=21.36µs  p(95)=33.22µs 
     http_req_connecting............: avg=17.3µs   min=0s      med=0s       max=1.61ms   p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=16.61ms  min=2.59ms  med=4.11ms   max=524.58ms p(90)=10.43ms  p(95)=31.88ms 
       { expected_response:true }...: avg=16.61ms  min=2.59ms  med=4.11ms   max=524.58ms p(90)=10.43ms  p(95)=31.88ms 
   ✓ http_req_failed................: 0.00%   0 out of 556
     http_req_receiving.............: avg=207.22µs min=82.08µs med=162.74µs max=8.35ms   p(90)=237.53µs p(95)=279.24µs
     http_req_sending...............: avg=58.89µs  min=21.86µs med=48.72µs  max=1.84ms   p(90)=75.27µs  p(95)=98µs    
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=16.34ms  min=2.44ms  med=3.89ms   max=524.3ms  p(90)=10ms     p(95)=31.62ms 
     http_reqs......................: 556     9.120495/s
     iteration_duration.............: avg=1.01s    min=1s      med=1s       max=1.52s    p(90)=1.01s    p(95)=1.03s   
     iterations.....................: 556     9.120495/s
     vus............................: 1       min=1            max=20
     vus_max........................: 20      min=20           max=20